<a href="https://colab.research.google.com/github/niroshank/data-mining-models/blob/master/Section_B_Naive_Bayes_ipyn.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**Author:** Niroshan Kumarasinghe 	

**IIT Student No:** IIT2019269

**RGU Student No:** RGU1912833	

**Course:** CMM704 Data Mining
  
**Assignment:** COURSEWORK SECTION B.02

In [0]:
# Naive Bayes Theorom provides a mechanism to generate the probability of a certain variable that belong to another variables
# P(Survived|Pclass,Sex,Age) = (P(Pclass,Sex,Age|Survived) * P(Survived)) / P(Pclass,Sex,Age)
# Where P(Survived|Pclass,Sex,Age) is the probability of titanic survived passengers given the pclass, sex and age data.
# Using the naive bayes theorom this classifier calculates the conditional independent given the class, instead of calculating the probabilty of 
# each variables.

In [0]:
# import required libries

import pandas as pd
import numpy as np
from sklearn import linear_model
import matplotlib.pyplot as plt
from google.colab import files

# upload dataset
from google.colab import files
uploaded=files.upload()

Saving titanic.csv to titanic.csv

In [0]:
# Create a dataframe
df = pd.read_csv('titanic.csv')
df.head(5)

# To get the probability of survived passenger of titanic dataset we select pclass, age and sex as the independat variables.

   Survived  Pclass  ... Parents/Children Aboard     Fare
0         0       3  ...                       0   7.2500
1         1       1  ...                       0  71.2833
2         1       3  ...                       0   7.9250
3         1       1  ...                       0  53.1000
4         0       3  ...                       0   8.0500

[5 rows x 8 columns]

In [0]:
# clean the dataset by dropping unnecessary data
df.drop(['Name', 'Siblings/Spouses Aboard', 'Parents/Children Aboard', 'Fare'],axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

In [0]:
# remove Survived col and save into another col called targets
inputs = df.drop('Survived', axis='columns')
targets = df.Survived
targets.head(5)

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [0]:
# Convert sex col into integer
inputs.Sex = inputs.Sex.map({'male':1, 'female':2})
dummies=pd.get_dummies(inputs.Sex)
dummies.head(3)

   1  2
0  1  0
1  0  1
2  0  1

In [0]:
# drop and concat 
inputs = pd.concat([inputs, dummies],axis='columns')
inputs.head()

   Pclass  Sex   Age  1  2
0       3    1  22.0  1  0
1       1    2  38.0  0  1
2       3    2  26.0  0  1
3       1    2  35.0  0  1
4       3    1  35.0  1  0

In [0]:
inputs.drop(['Sex'], axis='columns', inplace=True)
inputs.head()

   Pclass   Age  1  2
0       3  22.0  1  0
1       1  38.0  0  1
2       3  26.0  0  1
3       1  35.0  0  1
4       3  35.0  1  0

In [0]:
inputs.drop([2], axis='columns', inplace=True)
inputs.head()

   Pclass   Age  1
0       3  22.0  1
1       1  38.0  0
2       3  26.0  0
3       1  35.0  0
4       3  35.0  1

In [0]:
inputs = inputs.rename(columns={1: 'Gender'})
inputs.head()

   Pclass   Age  Gender
0       3  22.0       1
1       1  38.0       0
2       3  26.0       0
3       1  35.0       0
4       3  35.0       1

In [0]:
# drop empty values
inputs.columns[inputs.isna().any()]

Index([], dtype='object')

In [0]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, targets, test_size=0.3)
len(X_train)

620

In [0]:
# We use gaussian as the naive bayes
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [0]:
# Naive Bayes algorithm fitted two 2-dimensional Gaussian distribution to the data. 
# The means and the variances define these distributions completely.
print("Means:", model.theta_)
print("Standard deviations:", model.sigma_)

Means: [[ 2.53571429 29.93622449  0.85459184]
 [ 2.         27.58333333  0.31140351]]
Standard deviations: [[5.34438969e-01 1.89120933e+02 1.24264823e-01]
 [7.19298439e-01 1.97748475e+02 2.14431557e-01]]

In [0]:
# check the accuracy
model.score(X_test, y_test)

0.7677902621722846